avr-rust/avrd/packs/tiny/ATtiny87.atdf
    <module caption="Lockbits" name="LOCKBIT">
      <register-group caption="Lockbits" name="LOCKBIT">
        <register caption="" name="LOCKBIT" offset="0x00" size="1">
          <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
        </register>
      </register-group>
      <value-group caption="" name="ENUM_LB">
        <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
        <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
        <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
      </value-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTA">
        <register caption="Port A Data Register" name="PORTA" offset="0x22" size="1" mask="0xFF"/>
        <register caption="Port A Data Direction Register" name="DDRA" offset="0x21" size="1" mask="0xFF"/>
        <register caption="Port A Input Pins" name="PINA" offset="0x20" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port B Data Register" name="PORTB" offset="0x25" size="1" mask="0xFF"/>
        <register caption="Port B Data Direction Register" name="DDRB" offset="0x24" size="1" mask="0xFF"/>
        <register caption="Port B Input Pins" name="PINB" offset="0x23" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
    </module>
    <module caption="Local Interconnect Network" name="LINUART">
      <register-group caption="Local Interconnect Network" name="LINUART">
        <register caption="LIN Control Register" name="LINCR" offset="0xC8" size="1">
          <bitfield caption="Software Reset" mask="0x80" name="LSWRES"/>
          <bitfield caption="LIN Standard" mask="0x40" name="LIN13"/>
          <bitfield caption="LIN Configuration bits" mask="0x30" name="LCONF"/>
          <bitfield caption="LIN or UART Enable" mask="0x08" name="LENA"/>
          <bitfield caption="LIN Command and Mode bits" mask="0x07" name="LCMD"/>
        </register>
        <register caption="LIN Status and Interrupt Register" name="LINSIR" offset="0xC9" size="1">
          <bitfield caption="Identifier Status bits" mask="0xE0" name="LIDST"/>
          <bitfield caption="Busy Signal" mask="0x10" name="LBUSY"/>
          <bitfield caption="Error Interrupt" mask="0x08" name="LERR"/>
          <bitfield caption="Identifier Interrupt" mask="0x04" name="LIDOK"/>
          <bitfield caption="Transmit Performed Interrupt" mask="0x02" name="LTXOK"/>
          <bitfield caption="Receive Performed Interrupt" mask="0x01" name="LRXOK"/>
        </register>
        <register caption="LIN Enable Interrupt Register" name="LINENIR" offset="0xCA" size="1">
          <bitfield caption="Enable Error Interrupt" mask="0x08" name="LENERR"/>
          <bitfield caption="Enable Identifier Interrupt" mask="0x04" name="LENIDOK"/>
          <bitfield caption="Enable Transmit Performed Interrupt" mask="0x02" name="LENTXOK"/>
          <bitfield caption="Enable Receive Performed Interrupt" mask="0x01" name="LENRXOK"/>
        </register>
        <register caption="LIN Error Register" name="LINERR" offset="0xCB" size="1" ocd-rw="R">
          <bitfield caption="Abort Flag" mask="0x80" name="LABORT"/>
          <bitfield caption="Frame Time Out Error Flag" mask="0x40" name="LTOERR"/>
          <bitfield caption="Overrun Error Flag" mask="0x20" name="LOVERR"/>
          <bitfield caption="Framing Error Flag" mask="0x10" name="LFERR"/>
          <bitfield caption="Synchronization Error Flag" mask="0x08" name="LSERR"/>
          <bitfield caption="Parity Error Flag" mask="0x04" name="LPERR"/>
          <bitfield caption="Checksum Error Flag" mask="0x02" name="LCERR"/>
          <bitfield caption="Bit Error Flag" mask="0x01" name="LBERR"/>
        </register>
        <register caption="LIN Bit Timing Register" name="LINBTR" offset="0xCC" size="1">
          <bitfield caption="Disable Bit Timing Resynchronization" mask="0x80" name="LDISR"/>
          <bitfield caption="LIN Bit Timing bits" mask="0x3F" name="LBT"/>
        </register>
        <register caption="LIN Baud Rate Low Register" name="LINBRRL" offset="0xCD" size="1">
          <bitfield caption="" mask="0xFF" name="LDIV"/>
        </register>
        <register caption="LIN Baud Rate High Register" name="LINBRRH" offset="0xCE" size="1">
          <bitfield caption="" mask="0x0F" name="LDIV" lsb="8"/>
        </register>
        <register caption="LIN Data Length Register" name="LINDLR" offset="0xCF" size="1">
          <bitfield caption="LIN Transmit Data Length bits" mask="0xF0" name="LTXDL"/>
          <bitfield caption="LIN Receive Data Length bits" mask="0x0F" name="LRXDL"/>
        </register>
        <register caption="LIN Identifier Register" name="LINIDR" offset="0xD0" size="1">
          <bitfield caption="Parity bits" mask="0xC0" name="LP"/>
          <bitfield caption="Identifier bit 5 or Data Length bits" mask="0x3F" name="LID"/>
        </register>
        <register caption="LIN Data Buffer Selection Register" name="LINSEL" offset="0xD1" size="1">
          <bitfield caption="Auto Increment of Data Buffer Index (Active Low)" mask="0x08" name="LAINC"/>
          <bitfield caption="FIFO LIN Data Buffer Index bits" mask="0x07" name="LINDX"/>
        </register>
        <register caption="LIN Data Register" name="LINDAT" offset="0xD2" size="1" ocd-rw="">
          <bitfield caption="" mask="0xFF" name="LDATA"/>
        </register>
      </register-group>
    </module>
    <module caption="Universal Serial Interface" name="USI">
      <register-group caption="Universal Serial Interface" name="USI">
        <register caption="USI Pin Position" name="USIPP" offset="0xBC" size="1" mask="0x01"/>
        <register caption="USI Buffer Register" name="USIBR" offset="0xBB" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="USI Data Register" name="USIDR" offset="0xBA" size="1" mask="0xFF"/>
