avr-rust/avrd/packs/tiny/ATtiny87.atdf
        <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x6C" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT" lsb="8"/>
        </register>
        <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6B" size="1">
          <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT"/>
        </register>
      </register-group>
      <value-group caption="" name="INTERRUPT_SENSE_CONTROL2">
        <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
        <value caption="Any Logical Change in INTX" name="VAL_0x01" value="0x01"/>
        <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
        <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
          <bitfield caption="Clear Temporary Page Buffer" mask="0x10" name="CTPB"/>
          <bitfield caption="Read Fuse and Lock Bits" mask="0x08" name="RFLB"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Power Reduction Register" name="PRR" offset="0x64" size="1">
          <bitfield caption="Power Reduction LINUART" mask="0x20" name="PRLIN"/>
          <bitfield caption="Power Reduction SPI" mask="0x10" name="PRSPI"/>
          <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x04" name="PRTIM0"/>
          <bitfield caption="Power Reduction USI" mask="0x02" name="PRUSI"/>
          <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
        </register>
        <register caption="Stack Pointer  Bytes" name="SP" offset="0x5D" size="2" mask="0x07FF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="BOD Sleep" mask="0x40" name="BODS"/>
          <bitfield caption="BOD Sleep Enable" mask="0x20" name="BODSE"/>
          <bitfield caption="Pull-up Disable" mask="0x10" name="PUD"/>
        </register>
        <register caption="MCU Status register" name="MCUSR" offset="0x54" size="1">
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-On Reset Flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
          <bitfield caption="Sleep Mode Select Bits" mask="0x06" name="SM" values="CPU_SLEEP_MODE2"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
        <register caption="Oscillator Calibration Register" name="OSCCAL" offset="0x66" size="1" mask="0xFF" ocd-rw="R">
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="Clock Prescale Register" name="CLKPR" offset="0x61" size="1" ocd-rw="R">
          <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
          <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
        </register>
        <register caption="Clock Selection Register" name="CLKSELR" offset="0x63" size="1">
          <bitfield caption="Clock Out - CKOUT fuse substitution" mask="0x40" name="COUT"/>
          <bitfield caption="Clock Start-up Time bit 1 - SUT1 fuse substitution" mask="0x30" name="CSUT"/>
          <bitfield caption="Clock Source Select bit 3 - CKSEL3 fuse substitution" mask="0x0F" name="CSEL"/>
        </register>
        <register caption="Clock Control &amp; Status Register" name="CLKCSR" offset="0x62" size="1">
          <bitfield caption="Clock Control Change Enable" mask="0x80" name="CLKCCE"/>
          <bitfield caption="Clock Ready Flag" mask="0x10" name="CLKRDY"/>
          <bitfield caption="Clock Control bits" mask="0x0F" name="CLKC" values="CPU_CLK_COMMAND_LIST_4_BITS"/>
        </register>
        <register caption="DebugWire data register" name="DWDR" offset="0x51" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="General Purpose IO register 2" name="GPIOR2" offset="0x4B" size="1" mask="0xFF"/>
        <register caption="General Purpose register 1" name="GPIOR1" offset="0x4A" size="1" mask="0xFF"/>
        <register caption="General purpose register 0" name="GPIOR0" offset="0x3E" size="1" mask="0xFF"/>
        <register caption="Port Control Register" name="PORTCR" offset="0x32" size="1">
          <bitfield caption="" mask="0x20" name="BBMB"/>
          <bitfield caption="" mask="0x10" name="BBMA"/>
          <bitfield caption="" mask="0x02" name="PUDB"/>
          <bitfield caption="" mask="0x01" name="PUDA"/>
        </register>
      </register-group>
