avr-rust/avrd/packs/tiny/ATtiny87.atdf
      <value-group caption="" name="CPU_SLEEP_MODE2">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Reserved" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
        <value caption="256" name="VAL_0x08" value="0x08"/>
      </value-group>
      <value-group caption="" name="CPU_CLK_COMMAND_LIST_4_BITS">
        <value caption="No Command" name="VAL_0x00" value="0x00"/>
        <value caption="Disable Clock Source" name="VAL_0x01" value="0x01"/>
        <value caption="Enable Clock Source" name="VAL_0x02" value="0x02"/>
        <value caption="Request for Clock Availability" name="VAL_0x03" value="0x03"/>
        <value caption="Clock Source Switch" name="VAL_0x04" value="0x04"/>
        <value caption="Recovery System Clock Source Code" name="VAL_0x05" value="0x05"/>
        <value caption="Enable Watchdog in Automatic Reload Mode" name="VAL_0x06" value="0x06"/>
        <value caption="CKOUT Command" name="VAL_0x07" value="0x07"/>
        <value caption="From 0x08 up to 0x0F: No command" name="VAL_0x08" value="0x08"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>
      <parameters>
        <param name="CORE_VERSION" value="V2"/>
        <param name="NEW_INSTRUCTIONS" value="lpm rd,z+"/>
      </parameters>
    </module>
  </modules>
</avr-tools-device-file>
